InformationRegisters/БронированиеКомандировок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>БронированиеКомандировок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияБронированияКомандировки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаКомандировку</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗаявкаНаБронированиеКомандировки</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияБронированияКомандировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СостоянияБронированияКомандировки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыТранспортаБронированияБилетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыТранспортаБронированияБилетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Самолет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поезд</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыУслугБронированияКомандировок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыУслугБронированияКомандировок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Билеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проживание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Трансфер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыЗапросаБронированияМестаПроживания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыЗапросаБронированияМестаПроживания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Гостиница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Регион</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/БронированиеБилетовПроживания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>БронированиеБилетовПроживания</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДокумента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаКомандировкаКабинетСотрудника</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемаБронирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыБронированияКомандировок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БронироватьБилеты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТранспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТранспортаБронированияБилетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассПерелета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКлассаБронированияАвиабилетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГородВылета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГородВылетаПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГородПрилета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГородПрилетаПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтанцияОтправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтанцияОтправленияПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтанцияПрибытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтанцияПрибытияПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправленияТуда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправленияОбратно</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БилетВОдинКонец</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БронироватьПроживание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоПроживания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоПроживанияПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗапросаМестаПроживания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗапросаБронированияМестаПроживания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаездаПроживания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыездаПроживания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФамилияВПаспорте</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВПаспорте</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчествоВПаспорте</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПаспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДокументовБронированияБилетовПроживания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПаспорта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияПаспорта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФамилияЛатиницей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяЛатиницей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчествоЛатиницей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пожелания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/БронированиеКомандировокРасширенный/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.РегламентныеЗадания

// См. РегламентныеЗаданияПереопределяемый.ПриОпределенииНастроекРегламентныхЗаданий.
Процедура ПриОпределенииНастроекРегламентныхЗаданий(Зависимости) Экспорт
	
	Зависимость = Зависимости.Добавить();
	Зависимость.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ОтправкаЗаявокБронированияКомандировок;
	Зависимость.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.ИспользоватьБронированиеКомандировок;
	Зависимость.РаботаетСВнешнимиРесурсами = Истина;
	
	Зависимость = Зависимости.Добавить();
	Зависимость.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ПолучениеСостоянияБронированияКомандировок;
	Зависимость.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.ИспользоватьБронированиеКомандировок;
	Зависимость.РаботаетСВнешнимиРесурсами = Истина;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.РегламентныеЗадания

// СтандартныеПодсистемы.РаботаВМоделиСервиса.ОчередьЗаданий

// См. ОчередьЗаданийПереопределяемый.ПриПолученииСпискаШаблонов.
//
Процедура ПриПолученииСпискаШаблоновОчередиЗаданий(Шаблоны) Экспорт
	
	Шаблоны.Добавить(Метаданные.РегламентныеЗадания.ОтправкаЗаявокБронированияКомандировок.Имя);
	Шаблоны.Добавить(Метаданные.РегламентныеЗадания.ПолучениеСостоянияБронированияКомандировок.Имя);
	
КонецПроцедуры

// См. ОчередьЗаданийПереопределяемый.ПриОпределенииПсевдонимовОбработчиков.
//
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт
	
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ОтправкаЗаявокБронированияКомандировок.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ПолучениеСостоянияБронированияКомандировок.ИмяМетода);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.РаботаВМоделиСервиса.ОчередьЗаданий

// СтандартныеПодсистемы.ПрофилиБезопасности

// См. РаботаВБезопасномРежимеПереопределяемый.ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам.
//
Процедура ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам(ЗапросыРазрешений) Экспорт

	ИнтеграцияSmartway.ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам(ЗапросыРазрешений);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПрофилиБезопасности

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ПолучитьРезультатыБронированияПоЗаявкеДлительнаяОперация", Истина);
	Методы.Вставить("ПолучитьПодтверждениеБронированияДлительнаяОперация", Истина);
	Методы.Вставить("ПолучитьОрганизацииСистемыБронированияДлительнаяОперация", Истина)
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗапуститьОтправкуЗаявокБронированияКомандировок(ЗаявкаНаКомандировку = Неопределено) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьБронированиеКомандировок") Тогда 
		Возврат;
	КонецЕсли;
	
	Параметры = Новый Массив;
	Параметры.Добавить(ЗаявкаНаКомандировку);
	
	ФоновыеЗадания.Выполнить("БронированиеКомандировокРасширенный.ОтправитьЗаявкиБронированияКомандировок", Параметры);
	
КонецПроцедуры

Процедура ЗапуститьОтложеннуюОбработкуЗаявкиНаКомандировку(ЗаявкаНаКомандировку) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьБронированиеКомандировок") Тогда 
		Возврат;
	КонецЕсли;
	
	Параметры = Новый Массив;
	Параметры.Добавить(ЗаявкаНаКомандировку);
	
	ФоновыеЗадания.Выполнить("БронированиеКомандировокРасширенный.ВыполнитьОтложеннуюОбработкуЗаявкиНаБронирование", Параметры);
	
КонецПроцедуры

#Область ЗаявкаНаБронирование

Процедура ВыполнитьОтложеннуюОбработкуЗаявкиНаБронирование(ЗаявкаНаКомандировку) Экспорт
	
	ОтправитьЗаявкиБронированияКомандировок(ЗаявкаНаКомандировку);
	ПолучитьСостоянияБронированияКомандировок(ЗаявкаНаКомандировку);
	
КонецПроцедуры

Функция ИдентификаторЗаявкиПоСсылке(ЗаявкаСсылка) Экспорт
	Возврат "rq" + СтрЗаменить(Строка(ЗаявкаСсылка.УникальныйИдентификатор()), "-", "_");
КонецФункции

Функция ЗаявкаНаКомандировкуПоИдентификатору(Идентификатор) Экспорт
	
	Если Идентификатор = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПустаяСтрока(Идентификатор) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если СтрНайти(Идентификатор, "rq") = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Идентификатор = Прав(Идентификатор, СтрДлина(Идентификатор) - 2);
	Идентификатор = СтрЗаменить(Строка(Идентификатор), "_", "-");
	
	Если СтрНайти(Идентификатор, "-") = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УникальныйИдентификатор = Новый УникальныйИдентификатор(Идентификатор);
	
	Ссылка = Документы.БронированиеБилетовПроживания.ПолучитьСсылку(УникальныйИдентификатор);
	Если Не ОбщегоНазначения.СсылкаСуществует(Ссылка) И ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.СамообслуживаниеСотрудников") Тогда
		МодульСамообслуживаниеСотрудников = ОбщегоНазначения.ОбщийМодуль("СамообслуживаниеСотрудников");
		Ссылка = МодульСамообслуживаниеСотрудников.ЗаявкаНаКомандировкуПоИдентификатору(УникальныйИдентификатор);
	КонецЕсли;
	
	Если Не ОбщегоНазначения.СсылкаСуществует(Ссылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Ссылка;
	
КонецФункции

Процедура ПолучитьСостояниеБронированияПоЗаявке(ЗаявкаОбъект) Экспорт
	УстановитьСостояниеОтправлена(ЗаявкаОбъект);
	ПолучитьСостоянияБронированияКомандировок(ЗаявкаОбъект.Ссылка);
КонецПроцедуры

Процедура УстановитьСостояниеЗаявкиПодготовлена(ЗаявкаОбъект) Экспорт
	
	СостояниеЗаявки = Перечисления.СостоянияБронированияКомандировки.Подготовлено;
	УстановитьСостояниеБронированияЗаявки(ЗаявкаОбъект.Ссылка, СостояниеЗаявки, ЗаявкаОбъект);
	
КонецПроцедуры

Функция НовоеОписаниеДанныеЗаявки() Экспорт
	
	ДанныеЗаявки = Новый Структура("
	|Ссылка,
	|Согласована,
	|ФизическоеЛицо,
	|Ответственный,
	|ДатаНачала,
	|ДатаОкончания,
	|Организация,
	|СистемаБронирования,
	|БронироватьБилеты,
	|ВидТранспорта,
	|КлассПерелета,
	|ГородВылета,
	|ГородПрилета,
	|СтанцияОтправления,
	|СтанцияПрибытия,
	|ДатаОтправленияТуда,
	|ДатаОтправленияОбратно,
	|БилетВОдинКонец,
	|БронироватьПроживание,
	|МестоПроживания,
	|ВидЗапросаМестаПроживания,
	|ДатаЗаездаПроживания,
	|ДатаВыездаПроживания,
	|ФамилияВПаспорте,
	|ИмяВПаспорте,
	|ОтчествоВПаспорте,
	|ВидПаспорта,
	|НомерПаспорта,
	|СрокДействияПаспорта,
	|ФамилияЛатиницей,
	|ИмяЛатиницей,
	|ОтчествоЛатиницей,
	|ДатаРождения,
	|Пол,
	|Гражданство,
	|Телефон,
	|EMail,
	|Пожелания");
	
	Возврат ДанныеЗаявки;
	
КонецФункции

Функция ДобавитьПоездкуКДаннымБронирования(ДанныеБронирования, ДанныеЗаявки) Экспорт
	
	Если Не ДанныеЗаявки.БронироватьБилеты И Не ДанныеЗаявки.БронироватьПроживание Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НоваяПоездка = ДобавитьНовуюПоездку(ДанныеБронирования);
	НоваяПоездка.СистемаБронирования = ДанныеЗаявки.СистемаБронирования;
	НоваяПоездка.Заявка = ДанныеЗаявки.Ссылка;
	НоваяПоездка.ДатаНачала = ДанныеЗаявки.ДатаНачала;
	НоваяПоездка.ДатаОкончания = ДанныеЗаявки.ДатаОкончания;
	НоваяПоездка.Пожелания = ДанныеЗаявки.Пожелания;
	НоваяПоездка.Организация = ДанныеЗаявки.Организация;
	Если ЗначениеЗаполнено(ДанныеЗаявки.Организация) Тогда
		НоваяПоездка.ИННОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаявки.Организация, "ИНН");
	КонецЕсли;
	Если Не ДанныеЗаявки.Согласована Тогда
		НоваяПоездка.Отменена = Истина;
	КонецЕсли;
	
	ДобавитьФизическоеЛицоКДаннымБронирования(НоваяПоездка, ДанныеЗаявки);
	
	Если ДанныеЗаявки.БронироватьБилеты Тогда
		Если ДанныеЗаявки.ВидТранспорта = Перечисления.ВидыТранспортаБронированияБилетов.Самолет Тогда
			Билет = ДобавитьАвиаБилет(НоваяПоездка);
			ДобавитьФизическоеЛицоКДаннымБронирования(Билет, ДанныеЗаявки);
			Билет.Содержимое.КлассПерелета = ДанныеЗаявки.КлассПерелета;
			СегментМаршрута = Билет.Содержимое.Маршрут.Добавить();
			СегментМаршрута.ДатаОтправления = ДанныеЗаявки.ДатаОтправленияТуда;
			СегментМаршрута.ПунктОтправления = ДанныеЗаявки.ГородВылета;
			СегментМаршрута.ПунктПрибытия = ДанныеЗаявки.ГородПрилета;
			Если Не ДанныеЗаявки.БилетВОдинКонец Тогда
				СегментМаршрута = Билет.Содержимое.Маршрут.Добавить();
				СегментМаршрута.ДатаОтправления = ДанныеЗаявки.ДатаОтправленияОбратно;
				СегментМаршрута.ПунктОтправления = ДанныеЗаявки.ГородПрилета;
				СегментМаршрута.ПунктПрибытия = ДанныеЗаявки.ГородВылета;
			КонецЕсли;
		КонецЕсли;
		Если ДанныеЗаявки.ВидТранспорта = Перечисления.ВидыТранспортаБронированияБилетов.Поезд Тогда
			Билет = ДобавитьБилетНаПоезд(НоваяПоездка);
			ДобавитьФизическоеЛицоКДаннымБронирования(Билет, ДанныеЗаявки);
			Билет.Содержимое.ДатаОтправления = ДанныеЗаявки.ДатаОтправленияТуда;
			Билет.Содержимое.ПунктОтправления = ДанныеЗаявки.СтанцияОтправления;
			Билет.Содержимое.ПунктПрибытия = ДанныеЗаявки.СтанцияПрибытия;
			Если Не ДанныеЗаявки.БилетВОдинКонец Тогда
				Билет = ДобавитьБилетНаПоезд(НоваяПоездка);
				ДобавитьФизическоеЛицоКДаннымБронирования(Билет, ДанныеЗаявки);
				Билет.Содержимое.ДатаОтправления = ДанныеЗаявки.ДатаОтправленияОбратно;
				Билет.Содержимое.ПунктОтправления = ДанныеЗаявки.СтанцияПрибытия;
				Билет.Содержимое.ПунктПрибытия = ДанныеЗаявки.СтанцияОтправления;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ДанныеЗаявки.БронироватьПроживание Тогда
		БроньОтеля = ДобавитьУслугуПроживание(НоваяПоездка);
		ДобавитьФизическоеЛицоКДаннымБронирования(БроньОтеля, ДанныеЗаявки);
		БроньОтеля.Содержимое.МестоПроживания = ДанныеЗаявки.МестоПроживания;
		БроньОтеля.Содержимое.ВидЗапроса = ДанныеЗаявки.ВидЗапросаМестаПроживания;
		БроньОтеля.Содержимое.ДатаЗаезда = ДанныеЗаявки.ДатаЗаездаПроживания;
		БроньОтеля.Содержимое.ДатаВыезда = ДанныеЗаявки.ДатаВыездаПроживания;
	КонецЕсли;
	
	Возврат НоваяПоездка;
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеПоездки

Функция ДобавитьНовуюПоездку(ДанныеБронирования) Экспорт
	
	НоваяПоездка = ДанныеБронирования.Добавить();
	НоваяПоездка.Услуги = ТаблицаУслугБронирования();
	НоваяПоездка.ФизическиеЛица = БронированиеКомандировок.ТаблицаФизическихЛиц();
	
	Возврат НоваяПоездка;
	
КонецФункции

Функция ДобавитьАвиаБилет(Заявка) Экспорт
	
	НоваяУслуга = Заявка.Услуги.Добавить();
	НоваяУслуга.ВидУслуги = Перечисления.ВидыУслугБронированияКомандировок.Билеты;
	НоваяУслуга.Содержимое = Новый Структура(
		"ВидТранспорта, 
		|Маршрут,
		|КлассПерелета");
	НоваяУслуга.Содержимое.ВидТранспорта = Перечисления.ВидыТранспортаБронированияБилетов.Самолет;
	НоваяУслуга.Содержимое.Маршрут = ТаблицаАвиаМаршрута();
	НоваяУслуга.ФизическиеЛица = БронированиеКомандировок.ТаблицаФизическихЛиц();
	
	Возврат НоваяУслуга;
	
КонецФункции

Функция ДобавитьБилетНаПоезд(Заявка) Экспорт
	
	НоваяУслуга = Заявка.Услуги.Добавить();
	НоваяУслуга.ВидУслуги = Перечисления.ВидыУслугБронированияКомандировок.Билеты;
	НоваяУслуга.Содержимое = Новый Структура(
		"ВидТранспорта,
		|ПунктОтправления,
		|ПунктПрибытия,
		|ДатаОтправления");
	НоваяУслуга.Содержимое.ВидТранспорта = Перечисления.ВидыТранспортаБронированияБилетов.Поезд;
	НоваяУслуга.ФизическиеЛица = БронированиеКомандировок.ТаблицаФизическихЛиц();
	
	Возврат НоваяУслуга;
	
КонецФункции

Функция ДобавитьУслугуПроживание(Заявка) Экспорт
	
	НоваяУслуга = Заявка.Услуги.Добавить();
	НоваяУслуга.ВидУслуги = Перечисления.ВидыУслугБронированияКомандировок.Проживание;
	НоваяУслуга.Содержимое = Новый Структура(
		"МестоПроживания,
		|ВидЗапроса,
		|ДатаЗаезда,
		|ДатаВыезда");
	НоваяУслуга.Содержимое.ВидЗапроса = Перечисления.ВидыЗапросаБронированияМестаПроживания.Гостиница;
	НоваяУслуга.ФизическиеЛица = БронированиеКомандировок.ТаблицаФизическихЛиц();
	
	Возврат НоваяУслуга;
	
КонецФункции

Функция ДобавитьФизическоеЛицо(Услуга) Экспорт
	
	НовоеФизическоеЛицо = Услуга.ФизическиеЛица.Добавить();
	НовоеФизическоеЛицо.Документы = БронированиеКомандировок.ТаблицаДокументовФизическихЛиц();
	
	Возврат НовоеФизическоеЛицо;
	
КонецФункции

#КонецОбласти

#Область МетодыАвтоподстановки

Процедура АвтоПодборАэропорта(Текст, ДанныеВыбора) Экспорт
	
	Аэропорты = ТаблицаАэропортов();
	ИнтеграцияSmartwayРасширенный.ЗаполнитьАэропортыПоПодстроке(Аэропорты, Текст);
	
	Если Аэропорты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Для Каждого СтрокаТаблицы Из Аэропорты Цикл
		ПредставлениеАэропорта = ПредставлениеАэропорта(СтрокаТаблицы.Город, СтрокаТаблицы.Страна, СтрокаТаблицы.Название, СтрокаТаблицы.Код);
		ЭлементАвтоПодбора = ЭлементАвтоПодбора();
		ЭлементАвтоПодбора.Код = СтрокаТаблицы.Код;
		ЭлементАвтоПодбора.Представление = ПредставлениеАэропорта;
		ДанныеВыбора.Добавить(ЭлементАвтоПодбора, ПредставлениеАэропорта);
	КонецЦикла;
	
КонецПроцедуры

Процедура АвтоПодборЖДСтанции(Текст, ДанныеВыбора) Экспорт
	
	Станции = ТаблицаЖДСтанций();
	ИнтеграцияSmartwayРасширенный.ЗаполнитьСтанцииПоПодстроке(Станции, Текст);
	
	Если Станции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Для Каждого СтрокаТаблицы Из Станции Цикл
		ЭлементАвтоПодбора = ЭлементАвтоПодбора();
		ЭлементАвтоПодбора.Код = СтрокаТаблицы.Код;
		ЭлементАвтоПодбора.Представление = СтрокаТаблицы.Название;
		ДанныеВыбора.Добавить(ЭлементАвтоПодбора, СтрокаТаблицы.Название);
	КонецЦикла;
	
КонецПроцедуры

Процедура АвтоПодборГостиницы(Текст, ДанныеВыбора) Экспорт
	
	Гостиницы = ТаблицаГостиниц();
	ИнтеграцияSmartwayРасширенный.ЗаполнитьГостиницыПоПодстроке(Гостиницы, Текст);
	
	Если Гостиницы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Для Каждого СтрокаТаблицы Из Гостиницы Цикл
		ПредставлениеГостиницы = ПредставлениеГостиницы(СтрокаТаблицы.Город, СтрокаТаблицы.Страна, СтрокаТаблицы.Название);
		ЭлементАвтоПодбора = ЭлементАвтоПодбора();
		ЭлементАвтоПодбора.Код = СтрокаТаблицы.Код;
		ЭлементАвтоПодбора.Представление = ПредставлениеГостиницы;
		ЭлементАвтоПодбора.ВидЗапроса = СтрокаТаблицы.ВидЗапроса;
		ДанныеВыбора.Добавить(ЭлементАвтоПодбора, ПредставлениеГостиницы);
	КонецЦикла;
	
КонецПроцедуры

Функция ПредставлениеАэропорта(Город, Страна, Название, Код = Неопределено) Экспорт
	
	// АПК:1297-выкл Шаблон сообщения, не локализуется
	ШаблонПредставления = "[Город], [Страна] ([Название] - [Код])";
	Если Код = Неопределено Тогда
		ШаблонПредставления = "[Город], [Страна] ([Название])";
	КонецЕсли;
	
	Если Название = Город Тогда
		ШаблонПредставления = "[Город], [Страна] ([Код])";
		Если Код = Неопределено Тогда
			ШаблонПредставления = "[Город], [Страна]";
		КонецЕсли;
	КонецЕсли;
	// АПК:1297-вкл
	
	ПараметрыШаблона = Новый Структура(
		"Город,
		|Страна,
		|Название, 
		|Код");
	
	ПараметрыШаблона.Город = Город;
	ПараметрыШаблона.Страна = Страна;
	ПараметрыШаблона.Название = Название;
	ПараметрыШаблона.Код = Код;
	
	Возврат СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ШаблонПредставления, ПараметрыШаблона);
	
КонецФункции

Функция ПредставлениеГостиницы(Город, Страна, Название) Экспорт
	
	ШаблонПредставления = "[Название] ([Город])";
	Если Не ЗначениеЗаполнено(Название) Тогда
		ШаблонПредставления = "[Город], [Страна]";
	КонецЕсли;
	
	ПараметрыШаблона = Новый Структура(
		"Город,
		|Страна,
		|Название");
	
	ПараметрыШаблона.Город = Город;
	ПараметрыШаблона.Страна = Страна;
	ПараметрыШаблона.Название = Название;
	
	Возврат СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ШаблонПредставления, ПараметрыШаблона);
	
КонецФункции

#КонецОбласти

#Область ДлительныеОперации

Процедура ПолучитьОрганизацииСистемыБронированияДлительнаяОперация(Параметры, АдресРезультата) Экспорт
	
	Организации = ОрганизацииСистемыБронирования(Параметры.СистемаБронирования);
	
	ПоместитьВоВременноеХранилище(Организации, АдресРезультата);
	
КонецПроцедуры

Процедура ПолучитьРезультатыБронированияПоЗаявкеДлительнаяОперация(Параметры, АдресРезультата) Экспорт
	
	ЗаявкаСсылка = Параметры.ЗаявкаСсылка;
	СистемаБронирования = Параметры.СистемаБронирования;
	
	РезультатБронирования = РезультатыБронированияЗаявки(ЗаявкаСсылка, СистемаБронирования);
	
	ПоместитьВоВременноеХранилище(РезультатБронирования, АдресРезультата);
	
КонецПроцедуры

Процедура ПолучитьПодтверждениеБронированияДлительнаяОперация(Параметры, АдресРезультата) Экспорт
	
	ИдентификаторБрони = Параметры.ИдентификаторБрони;
	СистемаБронирования = Параметры.СистемаБронирования;
	
	ДанныеФайла = БроньПоИдентификатору(ИдентификаторБрони, СистемаБронирования);
	
	ПоместитьВоВременноеХранилище(ДанныеФайла, АдресРезультата);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РегламентныеЗадания

Процедура ОтправкаЗаявокБронированияКомандировок() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ОтправкаЗаявокБронированияКомандировок);
	
	УстановитьПривилегированныйРежим(Истина);
	ОтправитьЗаявкиБронированияКомандировок();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ПолучениеСостоянияБронированияКомандировок() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ПолучениеСостоянияБронированияКомандировок);
	
	УстановитьПривилегированныйРежим(Истина);
	ПолучитьСостоянияБронированияКомандировок();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область КонструкторыТаблиц

Функция ТаблицаУслугБронирования()
	
	Услуги = Новый ТаблицаЗначений;
	Услуги.Колонки.Добавить("ИдентификаторЗаявки", ОбщегоНазначения.ОписаниеТипаСтрока(38));
	Услуги.Колонки.Добавить("ЗаявкаСсылка", Метаданные.ОпределяемыеТипы.ЗаявкаНаБронированиеКомандировки.Тип);
	Услуги.Колонки.Добавить("Идентификатор", ОбщегоНазначения.ОписаниеТипаЧисло(16));
	Услуги.Колонки.Добавить("Номер", ОбщегоНазначения.ОписаниеТипаСтрока(32));
	Услуги.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Услуги.Колонки.Добавить("ИННОрганизации", ОбщегоНазначения.ОписаниеТипаСтрока(12));
	Услуги.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Услуги.Колонки.Добавить("ВидУслуги", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыУслугБронированияКомандировок"));
	Услуги.Колонки.Добавить("ФизическиеЛица", Новый ОписаниеТипов("ТаблицаЗначений"));
	Услуги.Колонки.Добавить("Содержимое", Новый ОписаниеТипов("Структура"));
	Услуги.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	Услуги.Колонки.Добавить("ФизическиеЛицаПредставление", Новый ОписаниеТипов("Строка"));
	
	Возврат Услуги;
	
КонецФункции

Функция ТаблицаАвиаМаршрута()
	
	Маршруты = Новый ТаблицаЗначений;
	Маршруты.Колонки.Добавить("ПунктОтправления", Новый ОписаниеТипов("Строка"));
	Маршруты.Колонки.Добавить("ПунктПрибытия", Новый ОписаниеТипов("Строка"));
	Маршруты.Колонки.Добавить("ДатаОтправления", Новый ОписаниеТипов("Дата"));
	
	Возврат Маршруты;
	
КонецФункции

#КонецОбласти

#Область ЗаявкаНаБронирование

#Область МетодыАвтоподстановки

Функция ТаблицаАэропортов()
	
	Аэропорты = Новый ТаблицаЗначений;
	Аэропорты.Колонки.Добавить("Код", Новый ОписаниеТипов("Строка"));
	Аэропорты.Колонки.Добавить("Название", Новый ОписаниеТипов("Строка"));
	Аэропорты.Колонки.Добавить("Город", Новый ОписаниеТипов("Строка"));
	Аэропорты.Колонки.Добавить("Страна", Новый ОписаниеТипов("Строка"));
	
	Возврат Аэропорты;
	
КонецФункции

Функция ТаблицаЖДСтанций()
	
	Станции = Новый ТаблицаЗначений;
	Станции.Колонки.Добавить("Код", Новый ОписаниеТипов("Строка"));
	Станции.Колонки.Добавить("Название", Новый ОписаниеТипов("Строка"));
	
	Возврат Станции;
	
КонецФункции

Функция ТаблицаГостиниц()
	
	Гостиницы = Новый ТаблицаЗначений;
	Гостиницы.Колонки.Добавить("Код", Новый ОписаниеТипов("Число"));
	Гостиницы.Колонки.Добавить("Название", Новый ОписаниеТипов("Строка"));
	Гостиницы.Колонки.Добавить("Город", Новый ОписаниеТипов("Строка"));
	Гостиницы.Колонки.Добавить("Страна", Новый ОписаниеТипов("Строка"));
	Гостиницы.Колонки.Добавить("ВидЗапроса", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыЗапросаБронированияМестаПроживания"));
	
	Возврат Гостиницы;
	
КонецФункции

Функция ЭлементАвтоПодбора()
	
	Возврат Новый Структура("Код, Представление, ВидЗапроса");
	
КонецФункции

#КонецОбласти

#Область ОтправкаЗаявки

Процедура ОтправитьЗаявкиБронированияКомандировок(ЗаявкаНаКомандировку = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 100
		|	БронированиеКомандировок.ЗаявкаНаКомандировку КАК ЗаявкаНаКомандировку
		|ИЗ
		|	РегистрСведений.БронированиеКомандировок КАК БронированиеКомандировок
		|ГДЕ
		|	БронированиеКомандировок.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияБронированияКомандировки.Подготовлено)";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	ОтборЗапроса = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор;
	Если ЗаявкаНаКомандировку <> Неопределено Тогда
		ОтборЗапроса.Добавить("БронированиеКомандировок.ЗаявкаНаКомандировку = &ЗаявкаНаКомандировку");
		Запрос.УстановитьПараметр("ЗаявкаНаКомандировку", ЗаявкаНаКомандировку);
	КонецЕсли;
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Пока Истина Цикл
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Прервать;
		КонецЕсли;
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.БронированиеКомандировок"); 
		ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ЗаявкаНаКомандировку", "ЗаявкаНаКомандировку");
		
		НачатьТранзакцию();
		Попытка
			Блокировка.Заблокировать();
			ЗаявкиНаКомандировку = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ЗаявкаНаКомандировку");
			ОтправитьЗаявкиВСистемуБронирования(ЗаявкиНаКомандировку);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
		
		Если ЗаявкаНаКомандировку <> Неопределено Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтправитьЗаявкиВСистемуБронирования(ЗаявкиНаКомандировку)
	
	ДанныеПоездок = ТаблицаПоездок();
	
	Заявки = Новый Массив;
	Бронирования = Новый Массив;
	Для каждого Заявка Из ЗаявкиНаКомандировку Цикл
		Если ТипЗнч(Заявка) = Тип("ДокументСсылка.БронированиеБилетовПроживания") Тогда
			Бронирования.Добавить(Заявка);
		Иначе
			Заявки.Добавить(Заявка);
		КонецЕсли;
	КонецЦикла;
	Если ЗначениеЗаполнено(Заявки) И ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.СамообслуживаниеСотрудников") Тогда
		МодульСамообслуживаниеСотрудников = ОбщегоНазначения.ОбщийМодуль("СамообслуживаниеСотрудников");
		МодульСамообслуживаниеСотрудников.ЗаполнитьДанныеДляБронирования(ДанныеПоездок, Заявки);
	КонецЕсли;
	Документы.БронированиеБилетовПроживания.ЗаполнитьДанныеДляБронирования(ДанныеПоездок, Бронирования);
	
	Для каждого ДанныеПоездки Из ДанныеПоездок Цикл
		СостояниеЗаявки = Неопределено;
		Попытка
			ИнтеграцияSmartwayРасширенный.ОтправитьЗаявкуНаБронирование(ДанныеПоездки, СостояниеЗаявки);
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ЗарегистрироватьОшибкуБронированияКомандировок(ИнформацияОбОшибке, НСтр("ru = 'Отправка заявки в систему бронирования'"));
		КонецПопытки;
		Если СостояниеЗаявки <> Неопределено Тогда
			УстановитьСостояниеБронированияЗаявки(ДанныеПоездки.Заявка, СостояниеЗаявки, ДанныеПоездки, ИнформацияОбОшибке);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПолучениеСостоянияБронирования

Процедура ПолучитьСостоянияБронированияКомандировок(ЗаявкаНаКомандировку = Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	БронированиеКомандировок.ЗаявкаНаКомандировку КАК ЗаявкаНаКомандировку
		|ИЗ
		|	РегистрСведений.БронированиеКомандировок КАК БронированиеКомандировок
		|ГДЕ
		|	БронированиеКомандировок.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияБронированияКомандировки.Отправлено)";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	ОтборЗапроса = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор;
	Если ЗаявкаНаКомандировку <> Неопределено Тогда
		ОтборЗапроса.Добавить("БронированиеКомандировок.ЗаявкаНаКомандировку = &ЗаявкаНаКомандировку");
		Запрос.УстановитьПараметр("ЗаявкаНаКомандировку", ЗаявкаНаКомандировку);
	КонецЕсли;
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.БронированиеКомандировок"); 
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ЗаявкаНаКомандировку", "ЗаявкаНаКомандировку");
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		ЗаявкиНаКомандировку = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ЗаявкаНаКомандировку");
		ПолучитьСостоянияВСистемеБронирования(ЗаявкиНаКомандировку);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ПолучитьСостоянияВСистемеБронирования(ЗаявкиНаКомандировку)
	
	РеквизитыОбъектов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ЗаявкиНаКомандировку, "Организация, СистемаБронирования");
	
	СостоянияЗаявок = ТаблицаСостоянияЗаявокБронирования();
	Для Каждого Заявка Из ЗаявкиНаКомандировку Цикл
		НоваяСтрока = СостоянияЗаявок.Добавить();
		НоваяСтрока.Заявка = Заявка;
		НоваяСтрока.ИдентификаторЗаявки = ИдентификаторЗаявкиПоСсылке(Заявка);
		РеквизитыОбъекта = РеквизитыОбъектов[Заявка];
		ЗаполнитьЗначенияСвойств(НоваяСтрока, РеквизитыОбъекта);
	КонецЦикла;
	
	Попытка
		ИнтеграцияSmartwayРасширенный.ЗаполнитьСостоянияЗаявокНаБронирование(СостоянияЗаявок);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ЗарегистрироватьОшибкуБронированияКомандировок(ИнформацияОбОшибке, НСтр("ru = 'Получение состояний заявок на бронирование'"));
	КонецПопытки;
	
	ОтборСтрок = Новый Структура("СостояниеПолучено");
	ОтборСтрок.СостояниеПолучено = Истина;
	НайденныеСтроки = СостоянияЗаявок.НайтиСтроки(ОтборСтрок);
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		УстановитьСостояниеБронированияЗаявки(НайденнаяСтрока.Заявка, НайденнаяСтрока.СостояниеБронирования, НайденнаяСтрока, ИнформацияОбОшибке);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Функция ТаблицаСостоянияЗаявокБронирования()
	
	СостоянияБронирования = Новый ТаблицаЗначений;
	СостоянияБронирования.Колонки.Добавить("ИдентификаторЗаявки", ОбщегоНазначения.ОписаниеТипаСтрока(38));
	СостоянияБронирования.Колонки.Добавить("Заявка", Метаданные.ОпределяемыеТипы.ЗаявкаНаБронированиеКомандировки.Тип);
	СостоянияБронирования.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	СостоянияБронирования.Колонки.Добавить("СистемаБронирования", Новый ОписаниеТипов("ПеречислениеСсылка.СистемыБронированияКомандировок"));
	СостоянияБронирования.Колонки.Добавить("СостояниеБронирования", Новый ОписаниеТипов("ПеречислениеСсылка.СостоянияБронированияКомандировки"));
	СостоянияБронирования.Колонки.Добавить("СостояниеПолучено", Новый ОписаниеТипов("Булево"));
	
	Возврат СостоянияБронирования;
	
КонецФункции

Функция РезультатыБронированияЗаявки(ЗаявкаСсылка, СистемаБронирования)
	
	Поездки = ТаблицаПоездок();
	
	ИнтеграцияSmartwayРасширенный.ЗагрузитьПоездкиПоЗаявке(Поездки, ЗаявкаСсылка, СистемаБронирования);
	
	ПодобратьФизическихЛиц(Поездки);
	
	ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаявкаСсылка, "ФизическоеЛицо");
	
	Бронирование = Новый Структура(
		"Билеты,
		|Проживание");
	Бронирование.Билеты = ТаблицаУслугБронирования();
	Бронирование.Проживание = ТаблицаУслугБронирования();
	
	ОтборСтрок = Новый Структура("Ссылка");
	ОтборСтрок.Ссылка = ФизическоеЛицо;
	
	Для Каждого Поездка Из Поездки Цикл
		Для Каждого Услуга Из Поездка.Услуги Цикл
			Если Услуга.ФизическиеЛица.НайтиСтроки(ОтборСтрок).Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			Если Услуга.ВидУслуги = Перечисления.ВидыУслугБронированияКомандировок.Билеты Тогда
				ЗаполнитьЗначенияСвойств(Бронирование.Билеты.Добавить(), Услуга);
			КонецЕсли;
			Если Услуга.ВидУслуги = Перечисления.ВидыУслугБронированияКомандировок.Проживание Тогда
				ЗаполнитьЗначенияСвойств(Бронирование.Проживание.Добавить(), Услуга);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Бронирование;
	
КонецФункции

Функция БроньПоИдентификатору(ИдентификаторБрони, СистемаБронирования)
	
	ДанныеФайла = Неопределено;
	
	ИнтеграцияSmartwayРасширенный.ПолучитьБроньПоИдентификатору(ИдентификаторБрони, ДанныеФайла, СистемаБронирования);
	
	Если ДанныеФайла = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ДанныеФайла;
	
КонецФункции

Процедура УстановитьСостояниеОтправлена(ЗаявкаОбъект)
	
	СостояниеЗаявки = Перечисления.СостоянияБронированияКомандировки.Отправлено;
	УстановитьСостояниеБронированияЗаявки(ЗаявкаОбъект.Ссылка, СостояниеЗаявки, ЗаявкаОбъект);
	
КонецПроцедуры

#КонецОбласти

Функция ДатаВСтроку(Дата) Экспорт
	
	Возврат Формат(Дата, "ДЛФ=D");
	
КонецФункции

Функция ШаблонПредставленияДней() Экспорт
	Возврат НСтр("ru = ';%1 день;;%1 дня;%1 дней;%1 дня'");
КонецФункции
	
Процедура ЗарегистрироватьОшибкуБронированияКомандировок(ИнформацияОбОшибке, ПредставлениеОбработки) Экспорт
	
	ИмяСобытия = НСтр("ru = 'Бронирование командировок'", ОбщегоНазначения.КодОсновногоЯзыка());
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Ошибка при бронировании командировок. Обратитесь к администратору.
              |Техническая информация:
              |При выполнении операции «%1» возникает
              |%2'"), 
		ПредставлениеОбработки,
		КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
	
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

Функция ФиксированнаяСтруктураСТаблицейЗначений(СтруктураСТаблицейЗначений)
	
	Для Каждого КлючИЗначение Из СтруктураСТаблицейЗначений Цикл
		Если ТипЗнч(КлючИЗначение.Значение) = Тип("ТаблицаЗначений") Тогда
			СтруктураСТаблицейЗначений.Вставить(КлючИЗначение.Ключ, ФиксированнаяТаблицаЗначений(КлючИЗначение.Значение));
		КонецЕсли;
		Если ТипЗнч(КлючИЗначение.Значение) = Тип("Структура") Тогда
			СтруктураСТаблицейЗначений.Вставить(КлючИЗначение.Ключ, ФиксированнаяСтруктураСТаблицейЗначений(КлючИЗначение.Значение));
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОбщегоНазначения.ФиксированныеДанные(СтруктураСТаблицейЗначений);
	
КонецФункции

Функция ФиксированнаяТаблицаЗначений(ТаблицаЗначений)
	
	Данные = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
		Структура = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицы);
		Структура = ФиксированнаяСтруктураСТаблицейЗначений(Структура);
		Данные.Добавить(Структура);
	КонецЦикла;
	
	Возврат ОбщегоНазначения.ФиксированныеДанные(Данные);
	
КонецФункции

Процедура ДобавитьФизическоеЛицоКДаннымБронирования(ПоездкаУслуга, ДанныеЗаявки)
	
	НовоеФизическоеЛицо = ДобавитьФизическоеЛицо(ПоездкаУслуга);
	НовоеФизическоеЛицо.Ссылка = ДанныеЗаявки.ФизическоеЛицо;
	НовоеФизическоеЛицо.Фамилия = ДанныеЗаявки.ФамилияВПаспорте;
	НовоеФизическоеЛицо.ФамилияЛатиницей = ДанныеЗаявки.ФамилияЛатиницей;
	НовоеФизическоеЛицо.Имя = ДанныеЗаявки.ИмяВПаспорте;
	НовоеФизическоеЛицо.ИмяЛатиницей = ДанныеЗаявки.ИмяЛатиницей;
	НовоеФизическоеЛицо.Отчество = ДанныеЗаявки.ОтчествоВПаспорте;
	НовоеФизическоеЛицо.ДатаРождения = ДанныеЗаявки.ДатаРождения;
	НовоеФизическоеЛицо.Пол = ДанныеЗаявки.Пол;
	НовоеФизическоеЛицо.Гражданство = ДанныеЗаявки.Гражданство;
	НовоеФизическоеЛицо.Телефон = ДанныеЗаявки.Телефон;
	НовоеФизическоеЛицо.EMail = ДанныеЗаявки.EMail;
	
	НовыйПаспорт = НовоеФизическоеЛицо.Документы.Добавить();
	НовыйПаспорт.ВидДокумента = ДанныеЗаявки.ВидПаспорта;
	НовыйПаспорт.НомерДокумента = ДанныеЗаявки.НомерПаспорта;
	НовыйПаспорт.СрокДействияДокумента = ДанныеЗаявки.СрокДействияПаспорта;
	
КонецПроцедуры

Процедура УстановитьСостояниеБронированияЗаявки(Заявка, СостояниеЗаявки, ДанныеПоездки, ИнформацияОбОшибке = Неопределено)
	
	НаборЗаписей = РегистрыСведений.БронированиеКомандировок.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЗаявкаНаКомандировку.Установить(Заявка);
	
	СтрокаНабора = НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаНабора, ДанныеПоездки);
	СтрокаНабора.ЗаявкаНаКомандировку = Заявка;
	СтрокаНабора.Состояние = СостояниеЗаявки;
	СтрокаНабора.ДатаСостояния = ТекущаяДатаСеанса();
	
	Если ИнформацияОбОшибке <> Неопределено Тогда
		СтрокаНабора.Комментарий = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ТаблицаПоездок() Экспорт
	
	Поездки = Новый ТаблицаЗначений;
	Поездки.Колонки.Добавить("ИдентификаторПоездки", ОбщегоНазначения.ОписаниеТипаЧисло(16));
	Поездки.Колонки.Добавить("Заявка", Метаданные.ОпределяемыеТипы.ЗаявкаНаБронированиеКомандировки.Тип);
	Поездки.Колонки.Добавить("Командировка", Новый ОписаниеТипов("ДокументСсылка.Командировка, ДокументСсылка.КомандировкиСотрудников"));
	Поездки.Колонки.Добавить("СистемаБронирования", Новый ОписаниеТипов("ПеречислениеСсылка.СистемыБронированияКомандировок"));
	Поездки.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Поездки.Колонки.Добавить("МестоНазначения", Новый ОписаниеТипов("Строка"));
	Поездки.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Поездки.Колонки.Добавить("ИННОрганизации", ОбщегоНазначения.ОписаниеТипаСтрока(12));
	Поездки.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата"));
	Поездки.Колонки.Добавить("ДатаОкончания", Новый ОписаниеТипов("Дата"));
	Поездки.Колонки.Добавить("ДатаИзменения", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	Поездки.Колонки.Добавить("Услуги", Новый ОписаниеТипов("ТаблицаЗначений"));
	Поездки.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	Поездки.Колонки.Добавить("Изменена", Новый ОписаниеТипов("Булево"));
	Поездки.Колонки.Добавить("Отменена", Новый ОписаниеТипов("Булево"));
	Поездки.Колонки.Добавить("ФизическиеЛица", Новый ОписаниеТипов("ТаблицаЗначений"));
	Поездки.Колонки.Добавить("ФизическиеЛицаПредставление", Новый ОписаниеТипов("Строка"));
	Поездки.Колонки.Добавить("Пожелания", Новый ОписаниеТипов("Строка"));
	Поездки.Колонки.Добавить("ОписаниеИзменений", Новый ОписаниеТипов("Строка"));
	
	Возврат Поездки;
	
КонецФункции

Процедура ПодобратьФизическихЛиц(Поездки) Экспорт
	
	ОбработанныеЛица = БронированиеКомандировок.ТаблицаФизическихЛиц();
	
	ОтборСтрок = Новый Структура(
		"Фамилия,
		|Имя,
		|Отчество");
	
	Для Каждого Поездка Из Поездки Цикл
		Для Каждого Услуга Из Поездка.Услуги Цикл
			Для Каждого ОписаниеЛица Из Услуга.ФизическиеЛица Цикл
				Если ЗначениеЗаполнено(ОписаниеЛица.Ссылка) Тогда
					// Физическое лицо уже было найдено.
					Продолжить;
				КонецЕсли;
				Если ЗначениеЗаполнено(ОписаниеЛица.Идентификатор) Тогда
					ФизическоеЛицоСсылка = ФизическоеЛицоПоИдентификатору(ОписаниеЛица.Идентификатор);
					Если ЗначениеЗаполнено(ФизическоеЛицоСсылка) Тогда
						ОписаниеЛица.Ссылка = ФизическоеЛицоСсылка;
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(ОтборСтрок, ОписаниеЛица);
				НайденныеСтроки = ОбработанныеЛица.НайтиСтроки(ОтборСтрок);
				Если НайденныеСтроки.Количество() > 0 Тогда
					// Проверяем тот же это человек или нет по совпадению документов.
					Если ОбщегоНазначения.КоллекцииИдентичны(НайденныеСтроки[0].Документы, ОписаниеЛица.Документы, "ВидДокумента,НомерДокумента") Тогда
						ОписаниеЛица.Ссылка = НайденныеСтроки[0].Ссылка;
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				ОбработанноеЛицо = ОбработанныеЛица.Добавить();
				ЗаполнитьЗначенияСвойств(ОбработанноеЛицо, ОписаниеЛица);
				
				ПараметрыПоиска = СотрудникиКлиентСервер.ПараметрыПоискаПохожих();
				ПараметрыПоиска.Фамилия = ОписаниеЛица.Фамилия;
				ПараметрыПоиска.Имя = ОписаниеЛица.Имя;
				ПараметрыПоиска.Отчество = ОписаниеЛица.Отчество;
				
				РезультатПоиска = СотрудникиФормы.ПохожиеФизическиеЛица(ПараметрыПоиска);
				Если РезультатПоиска.ФизическоеЛицоУникально = Истина Тогда
					// Не нашли.
					Продолжить;
				КонецЕсли;
				Если Не РезультатПоиска.Свойство("ДанныеФизическихЛицДоступны") Тогда
					Продолжить;
				КонецЕсли;
				Если Не РезультатПоиска.ДанныеФизическихЛицДоступны Тогда
					// Данные недоступны.
					Продолжить;
				КонецЕсли;
				ФизическоеЛицоБезДокументов = Неопределено;
				ФизическоеЛицоДокументСовпадает = Неопределено;
				Для Каждого ДанныеЛица Из РезультатПоиска.ДанныеФизическихЛиц Цикл
					Если Не ЗначениеЗаполнено(ДанныеЛица.ДокументВид) Тогда
						ФизическоеЛицоБезДокументов = ДанныеЛица.ФизическоеЛицо;
						Продолжить;
					КонецЕсли;
					ОтборДокументов = Новый Структура("НомерДокумента");
					ОтборДокументов.НомерДокумента = СтрЗаменить(СокрЛП(ДанныеЛица.ДокументНомер) + СокрЛП(ДанныеЛица.ДокументСерия), " ", "");
					НайденныеДокументы = ОписаниеЛица.Документы.НайтиСтроки(ОтборДокументов);
					Если НайденныеДокументы.Количество() > 0 Тогда
						ФизическоеЛицоДокументСовпадает = ДанныеЛица.ФизическоеЛицо;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если ФизическоеЛицоДокументСовпадает <> Неопределено Тогда
					ОписаниеЛица.Ссылка = ФизическоеЛицоДокументСовпадает;
					ОбработанноеЛицо.Ссылка = ФизическоеЛицоДокументСовпадает;
					Продолжить;
				КонецЕсли;
				Если ФизическоеЛицоБезДокументов <> Неопределено Тогда
					Если РезультатПоиска.ДанныеФизическихЛиц.Количество() = 1 Тогда
						ОписаниеЛица.Ссылка = ФизическоеЛицоБезДокументов;
						ОбработанноеЛицо.Ссылка = ФизическоеЛицоБезДокументов;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ФизическоеЛицоПоИдентификатору(Идентификатор)
	
	Если Идентификатор = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПустаяСтрока(Идентификатор) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УникальныйИдентификатор = Новый УникальныйИдентификатор(Идентификатор);
	
	Ссылка = Справочники.ФизическиеЛица.ПолучитьСсылку(УникальныйИдентификатор);
	Если Не ОбщегоНазначения.СсылкаСуществует(Ссылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Ссылка;
	
КонецФункции

Функция ОрганизацияПоИНН(ИНН) Экспорт
	Возврат Справочники.Организации.НайтиПоРеквизиту("ИНН", ИНН);
КонецФункции

Функция ТаблицаОрганизаций()
	
	Организации = Новый ТаблицаЗначений;
	Организации.Колонки.Добавить("ИНН", Новый ОписаниеТипов("Строка"));
	Организации.Колонки.Добавить("КПП", Новый ОписаниеТипов("Строка"));
	Организации.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	Организации.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	
	Возврат Организации;
	
КонецФункции

Процедура ПодобратьСсылкиОрганизаций(Организации)
	
	Для Каждого СтрокаТаблицы Из Организации Цикл
		СтрокаТаблицы.Ссылка = ОрганизацияПоИНН(СтрокаТаблицы.ИНН);
	КонецЦикла;
	
КонецПроцедуры

Функция ОрганизацииСистемыБронирования(СистемаБронирования)
	
	Организации = ТаблицаОрганизаций();
	
	ИнтеграцияSmartwayРасширенный.ЗаполнитьОрганизацииСистемыБронирования(Организации, СистемаБронирования);
	
	ПодобратьСсылкиОрганизаций(Организации);
	
	Возврат Организации;
	
КонецФункции

#КонецОбласти
